app/Controllers/PropiedadesController.php

SELECT *
FROM `propiedades`
ORDER BY `id` ASC
---
    public function index()
    {
        $model = new PropiedadesModel();
        $data['propiedades'] = $model->orderBy('id', 'ASC')->findAll();

SELECT *
FROM `propiedades`
WHERE `id` = '38'
 LIMIT 1
---
    public function show($id = null){
        $model = new PropiedadesModel();
        $data = $model->where('id', $id)->first();

INSERT INTO `propiedades` (`titulo`, `precio`, `imagen`, `descripcion`, `habitaciones`, `wc`, `estacionamiento`, `creado`, `vendedores_id`) VALUES ('Hola Mundo!!!', '1200000', 'asd.jpg', 'Una hermosa casa en la montaña con una vista hermosa. Rodeada de un bosque con un montón de lagos cerca que visitar.', '3', '2', '1', '2023-05-12', '1')
---
    public function create(){
        $model = new PropiedadesModel();

        $validation = \Config\Services::validation();
        $validation->setRules($model->validationRules);


        $data = [
            'titulo' => $this->request->getVar('titulo'),
            'precio' => $this->request->getVar('precio'),
            'imagen' => $this->request->getVar('imagen'),
            'descripcion' => $this->request->getVar('descripcion'),
            'habitaciones' => $this->request->getVar('habitaciones'),
            'wc' => $this->request->getVar('wc'),
            'estacionamiento' => $this->request->getVar('estacionamiento'),
            'creado' => $this->request->getVar('creado'),
            'vendedores_id' => $this->request->getVar('vendedores_id'),
        ];

        if(!$validation->run($data)) {
            $response = [
                'status' => 400,
                'error' => true,
                'messages' => $validation->getErrors(),
            ];
            return $this->respond($response, 400);
        }

        $model->insert($data);

UPDATE `propiedades` SET `titulo` = 'Casa en la playa', `precio` = '5400000.00', `imagen` = 'una.jpg', `descripcion` = 'Una casa bonita en la playa', `habitaciones` = '3', `wc` = '2', `estacionamiento` = '1', `creado` = '2023-05-25', `vendedores_id` = '1'
WHERE `propiedades`.`id` IN ('40')
---
    public function update($id = null){
        $model = model(PropiedadesModel::class);
        if(is_null($id)){
            $id = $this->request->getVar('id');
            var_dump($id);
        }
        $data = ['titulo' => $this->request->getVar('titulo'),
                'precio' => $this->request->getVar('precio'),
                'imagen' => $this->request->getVar('imagen'),
                'descripcion' => $this->request->getVar('descripcion'),
                'habitaciones' => $this->request->getVar('habitaciones'),
                'wc' => $this->request->getVar('wc'),
                'estacionamiento' => $this->request->getVar('estacionamiento'),
                'creado' => $this->request->getVar('creado'),
                'vendedores_id' => $this->request->getVar('vendedores_id')
            ];

            $model->where('id',$id)->set($data)->update($id,$data);